Revit 2026 API

# Schema Properties

---

The Schema type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ApplicationGUID | The GUID of the application or add-in that may access entities of this Schema under the Application access level. |
|  | Documentation | The overall description of the Schema. |
|  | GUID | The identifier of the Schema. Setter made unavailable, because it would violate set-correctness |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ReadAccessLevel | Read access level of the schema. |
|  | SchemaName | The user-friendly name of the Schema. |
|  | VendorId | The id of the third-party vendor that may access entities of this Schema under the Vendor access level. |
|  | WriteAccessLevel | Write access level of the schema. |

#### Reference

Schema Class

Autodesk.Revit.DB.ExtensibleStorage Namespace